app/controllers/todo_items_controller.rb

INSERT INTO "todo_items" ("content", "todo_list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "aa"], ["todo_list_id", 1], ["created_at", "2015-10-15 22:57:23.026000"], ["updated_at", "2015-10-15 22:57:23.026000"]]
---
	def create
		@todo_item = @todo_list.todo_items.create(todo_item_params)

DELETE FROM "todo_items" WHERE "todo_items"."id" = $1  [["id", 1]]
---
	def destroy
		if @todo_item.destroy